tutorials/incompressible/simpleFoam/mixingPlaneDomADomB/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     5.0                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  | For copyright notice see file Copyright         |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
numberOfSubdomains 4;

method metis;     //metis; //simple;

globalFaceZones
(
    ggi1DomBZone
    ggi1DomAZone
    ggi2DomBZone
    ggi2DomAZone
);

manualCoeffs
{
  dataFile "manualDecomp.txt";
}

simpleCoeffs
{
  n (1 4 1);
  delta 0.001;
}

distributed no;

roots
(
);

